# [cite_start]EF-YOLO 论文模型配置 [cite: 2]
nc: 2  # 修改这里！假设你要检测 火 和 烟雾，就是2类
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [cite_start][-1, 1, SPDConv, [256]]    # [cite: 3] 替换下采样
  - [-1, 6, C2f, [256, True]]
  - [cite_start][-1, 1, SPDConv, [512]]    # [cite: 3] 替换下采样
  - [-1, 6, C2f, [512, True]]
  - [cite_start][-1, 1, SPDConv, [1024]]   # [cite: 3] 替换下采样
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [cite_start][-1, 1, DP_FSE, [512]]     # [cite: 12] 增强模块

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [cite_start][-1, 1, DP_FSE, [256]]     # [cite: 12] 增强模块

  # [cite_start]P2 微小目标层 [cite: 20]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]
  - [cite_start][-1, 1, DP_FSE, [128]]     # [cite: 12] 增强模块

  - [[21, 17, 13, 10], 1, Detect, [nc]]